/*************************************************************************************************************
*    Titre:         Fichier d'en-tête pour le clavier 4x4
*    Fichier:       kb.h
*    Date:          4/02/2008
*************************************************************************************************************/

/************************************************************************************************************
 ** @file kb.h                                                                                            
 ** @brief Fichier d'en-tête pour le clavier 4x4                                                            
 ************************************************************************************************************/

#ifndef __KB_H__
#define __KB_H__

/*************************************************************************************************************
	Définitions des constantes
*************************************************************************************************************/
#define FALSE 0
#define TRUE 1
#define KB_CHARS 16
#define KB_TIMEOUT 12288  // 3 sec
#define KB_SLACKER	16

/*************************************************************************************************************
	Définitions des variables globales
*************************************************************************************************************/
volatile unsigned char KB_scan_line;
volatile unsigned char KB_key;
volatile unsigned char KB_keypressed;
volatile unsigned char KB_ready;
volatile unsigned int KB_timer;
volatile unsigned char KB_buf[KB_CHARS];
volatile unsigned char KB_char_cnt;
volatile unsigned char KB_in_read;

/*************************************************************************************************************
	Définition des fonctions
*************************************************************************************************************/
void KB_Init(void);
void KB_int_proc(void);

#endif
